
## Plan Result

[CI link](https://github.com/marwenbhriz/ga-terraform/actions/runs/9928444856)


<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.cloudsql.google_compute_global_address.private_ip_address
  * module.cloudsql.google_service_networking_connection.arai-2-private-vpc-connection
  * module.cloudsql.google_sql_database.database
  * module.cloudsql.google_sql_database_instance.default
  * module.cloudsql.google_sql_user.gauser


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloudsql.google_compute_global_address.private_ip_address will be created
  + resource "google_compute_global_address" "private_ip_address" {
      + address            = "191.100.0.0"
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "ga-private-ip-address"
      + network            = "https://www.googleapis.com/compute/v1/projects/grasys-study/global/networks/ga-vpc"
      + prefix_length      = 20
      + project            = "grasys-study"
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
    }

  # module.cloudsql.google_service_networking_connection.arai-2-private-vpc-connection will be created
  + resource "google_service_networking_connection" "arai-2-private-vpc-connection" {
      + id                      = (known after apply)
      + network                 = "https://www.googleapis.com/compute/v1/projects/grasys-study/global/networks/ga-vpc"
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "ga-private-ip-address",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.cloudsql.google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + charset         = "utf8"
      + collation       = "utf8_general_ci"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "ga-terraform"
      + name            = "books"
      + project         = "grasys-study"
      + self_link       = (known after apply)
    }

  # module.cloudsql.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "MYSQL_8_0"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "ga-terraform"
      + private_ip_address             = (known after apply)
      + project                        = "grasys-study"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-northeast1"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = true
              + enabled                        = true
              + location                       = "asia"
              + start_time                     = "00:00"
              + transaction_log_retention_days = 5

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = false
              + ipv4_enabled                                  = false
              + private_network                               = "projects/grasys-study/global/networks/ga-vpc"
              + require_ssl                                   = false
              + ssl_mode                                      = (known after apply)
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + secondary_zone         = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # module.cloudsql.google_sql_user.gauser will be created
  + resource "google_sql_user" "gauser" {
      + host                    = "%"
      + id                      = (known after apply)
      + instance                = "ga-terraform"
      + name                    = "gauser"
      + password                = (sensitive value)
      + project                 = "grasys-study"
      + sql_server_user_details = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Argument is deprecated

  with module.cloudsql.google_sql_database_instance.default,
  on modules/cloudsql/main.tf line 34, in resource "google_sql_database_instance" "default":
  34:       require_ssl = false 

`require_ssl` will be fully deprecated in a future major release. For now,
please use `ssl_mode` with a compatible `require_ssl` value instead.

```



<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":13,"Program":"tfcmt","SHA1":"04f5be195ada139c2c64fc9a50f7e7c4d396d072","Vars":{},"WorkflowName":"terraform plan"} -->